eesimonsu/nRF5_SDK_15.3.0/examples/ble_central_and_peripheral/experimental/ble_app_scan_adv_test/main.c
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
	ret_code_t err_code;
	ble_gap_evt_adv_report_t const * p_adv =
		p_scan_evt->params.filter_match.p_adv_report;
	ble_gap_scan_params_t    const * p_scan_param =
		p_scan_evt->p_scan_params;

	switch (p_scan_evt->scan_evt_id)
	{
	case NRF_BLE_SCAN_EVT_FILTER_MATCH:
	{
		// Initiate connection.
		err_code = sd_ble_gap_connect(&p_adv->peer_addr,
			p_scan_param,
			&m_scan.conn_params,
			APP_BLE_CONN_CFG_TAG);
		APP_ERROR_CHECK(err_code);
	} break;

	default:
		break;
	}
}


/**@brief Function for initialization the scanning and setting the filters.
 */
static void scan_init(void)
{
	ret_code_t          err_code;
	nrf_ble_scan_init_t init_scan;

	memset(&init_scan, 0, sizeof(init_scan));

	init_scan.p_scan_param = &m_scan_param;

	err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
	APP_ERROR_CHECK(err_code);



	//    if (strlen(m_target_periph_name) != 0)
	//    {
	//        err_code = nrf_ble_scan_filter_set(&m_scan, 
	//                                           SCAN_NAME_FILTER, 
	//                                           m_target_periph_name);
	//        APP_ERROR_CHECK(err_code);
	//    }
	//
	//    err_code = nrf_ble_scan_filter_set(&m_scan, 
	//                                       SCAN_UUID_FILTER, 
	//                                       &m_adv_uuids[HART_RATE_SERVICE_UUID_IDX]);
	//    APP_ERROR_CHECK(err_code);
	//
	//    err_code = nrf_ble_scan_filter_set(&m_scan, 
	//                                       SCAN_UUID_FILTER, 
	//                                       &m_adv_uuids[RSCS_SERVICE_UUID_IDX]);
	//    APP_ERROR_CHECK(err_code);

	err_code = nrf_ble_scan_filters_enable(&m_scan,
		NRF_BLE_SCAN_ALL_FILTER,
		false);
	APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the scanning.
 */
static void scan_start(void)
{
	ret_code_t err_code;

	err_code = nrf_ble_scan_start(&m_scan);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the advertising and the scanning.
 */
static void adv_scan_start(void)
{
	ret_code_t err_code;

	//check if there are no flash operations in progress
	if (!nrf_fstorage_is_busy(NULL))
	{
		// Start scanning for peripherals and initiate connection to devices which
		// advertise Heart Rate or Running speed and cadence UUIDs.
		scan_start();

		// Turn on the LED to signal scanning.
		bsp_board_led_on(CENTRAL_SCANNING_LED);

		// Start advertising.
		err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
		APP_ERROR_CHECK(err_code);
	}
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
	case PM_EVT_PEERS_DELETE_SUCCEEDED:
		adv_scan_start();
		break;

	default:
		break;
	}
}


/**@brief Function for changing filter settings after establishing the connection.
 */
static void filter_settings_change(void)
{
	ret_code_t err_code;

	err_code = nrf_ble_scan_all_filter_remove(&m_scan);
	APP_ERROR_CHECK(err_code);

	if (strlen(m_target_periph_name) != 0)
	{
		err_code = nrf_ble_scan_filter_set(&m_scan,
			SCAN_NAME_FILTER,
			m_target_periph_name);
		APP_ERROR_CHECK(err_code);
	}

	if ((m_conn_handle_hrs_c != BLE_CONN_HANDLE_INVALID) &&
		(m_conn_handle_rscs_c == BLE_CONN_HANDLE_INVALID))
	{
		err_code = nrf_ble_scan_filter_set(&m_scan,
			SCAN_UUID_FILTER,
			&m_adv_uuids[RSCS_SERVICE_UUID_IDX]);
	}

	if ((m_conn_handle_rscs_c != BLE_CONN_HANDLE_INVALID) &&
		m_conn_handle_hrs_c == BLE_CONN_HANDLE_INVALID)
	{
		err_code = nrf_ble_scan_filter_set(&m_scan,
			SCAN_UUID_FILTER,
			&m_adv_uuids[HART_RATE_SERVICE_UUID_IDX]);
	}

	APP_ERROR_CHECK(err_code);
}


/**@brief Handles events coming from the Heart Rate central module.
 */
static void hrs_c_evt_handler(ble_hrs_c_t * p_hrs_c, ble_hrs_c_evt_t * p_hrs_c_evt)
{
	switch (p_hrs_c_evt->evt_type)
	{
	case BLE_HRS_C_EVT_DISCOVERY_COMPLETE:
	{
		if (m_conn_handle_hrs_c == BLE_CONN_HANDLE_INVALID)
		{
			ret_code_t err_code;

			m_conn_handle_hrs_c = p_hrs_c_evt->conn_handle;
			NRF_LOG_INFO("HRS discovered on conn_handle 0x%x", m_conn_handle_hrs_c);

			filter_settings_change();

			err_code = ble_hrs_c_handles_assign(p_hrs_c,
				m_conn_handle_hrs_c,
				&p_hrs_c_evt->params.peer_db);
			APP_ERROR_CHECK(err_code);
			// Initiate bonding.
			err_code = pm_conn_secure(m_conn_handle_hrs_c, false);
			if (err_code != NRF_ERROR_BUSY)
			{
				APP_ERROR_CHECK(err_code);
			}

			// Heart rate service discovered. Enable notification of Heart Rate Measurement.
			err_code = ble_hrs_c_hrm_notif_enable(p_hrs_c);
			APP_ERROR_CHECK(err_code);
		}
	} break; // BLE_HRS_C_EVT_DISCOVERY_COMPLETE

	case BLE_HRS_C_EVT_HRM_NOTIFICATION:
	{
		ret_code_t err_code;

		NRF_LOG_INFO("Heart Rate = %d", p_hrs_c_evt->params.hrm.hr_value);

		err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, p_hrs_c_evt->params.hrm.hr_value);
		if ((err_code != NRF_SUCCESS) &&
			(err_code != NRF_ERROR_INVALID_STATE) &&
			(err_code != NRF_ERROR_RESOURCES) &&
			(err_code != NRF_ERROR_BUSY) &&
			(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
			)
		{
			APP_ERROR_HANDLER(err_code);
		}
	} break; // BLE_HRS_C_EVT_HRM_NOTIFICATION

	default:
		// No implementation needed.
		break;
	}
}


/**@brief Handles events coming from  Running Speed and Cadence central module.
 */
static void rscs_c_evt_handler(ble_rscs_c_t * p_rscs_c, ble_rscs_c_evt_t * p_rscs_c_evt)
{
	switch (p_rscs_c_evt->evt_type)
	{
	case BLE_RSCS_C_EVT_DISCOVERY_COMPLETE:
	{
		if (m_conn_handle_rscs_c == BLE_CONN_HANDLE_INVALID)
		{
			ret_code_t err_code;

			m_conn_handle_rscs_c = p_rscs_c_evt->conn_handle;
			NRF_LOG_INFO("Running Speed and Cadence service discovered on conn_handle 0x%x",
				m_conn_handle_rscs_c);

			filter_settings_change();

			err_code = ble_rscs_c_handles_assign(p_rscs_c,
				m_conn_handle_rscs_c,
				&p_rscs_c_evt->params.rscs_db);
			APP_ERROR_CHECK(err_code);

