eesimonsu/nRF5_SDK_15.3.0/examples/ble_central_and_peripheral/experimental/ble_app_scan_adv_test/main.c
			// Initiate bonding.
			err_code = pm_conn_secure(m_conn_handle_rscs_c, false);
			if (err_code != NRF_ERROR_BUSY)
			{
				APP_ERROR_CHECK(err_code);
			}

			// Running Speed Cadence Service discovered. Enable notifications.
			err_code = ble_rscs_c_rsc_notif_enable(p_rscs_c);
			APP_ERROR_CHECK(err_code);
		}
	} break; // BLE_RSCS_C_EVT_DISCOVERY_COMPLETE:

	case BLE_RSCS_C_EVT_RSC_NOTIFICATION:
	{
		ret_code_t      err_code;
		ble_rscs_meas_t rscs_measurment;

		NRF_LOG_INFO("Speed      = %d", p_rscs_c_evt->params.rsc.inst_speed);

		rscs_measurment.is_running = p_rscs_c_evt->params.rsc.is_running;
		rscs_measurment.is_inst_stride_len_present = p_rscs_c_evt->params.rsc.is_inst_stride_len_present;
		rscs_measurment.is_total_distance_present = p_rscs_c_evt->params.rsc.is_total_distance_present;

		rscs_measurment.inst_stride_length = p_rscs_c_evt->params.rsc.inst_stride_length;
		rscs_measurment.inst_cadence = p_rscs_c_evt->params.rsc.inst_cadence;
		rscs_measurment.inst_speed = p_rscs_c_evt->params.rsc.inst_speed;
		rscs_measurment.total_distance = p_rscs_c_evt->params.rsc.total_distance;

		err_code = ble_rscs_measurement_send(&m_rscs, &rscs_measurment);
		if ((err_code != NRF_SUCCESS) &&
			(err_code != NRF_ERROR_INVALID_STATE) &&
			(err_code != NRF_ERROR_RESOURCES) &&
			(err_code != NRF_ERROR_BUSY) &&
			(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
			)
		{
			APP_ERROR_HANDLER(err_code);
		}
	} break; // BLE_RSCS_C_EVT_RSC_NOTIFICATION

	default:
		// No implementation needed.
		break;
	}
}


/**@brief Function for assigning new connection handle to available instance of QWR module.
 *
 * @param[in] conn_handle New connection handle.
 */
static void multi_qwr_conn_handle_assign(uint16_t conn_handle)
{
	for (uint32_t i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		if (m_qwr[i].conn_handle == BLE_CONN_HANDLE_INVALID)
		{
			ret_code_t err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr[i], conn_handle);
			APP_ERROR_CHECK(err_code);
			break;
		}
	}
}


/**@brief   Function for handling BLE events from the central application.
 *
 * @details This function parses scanning reports and initiates a connection to peripherals when a
 *          target UUID is found. It updates the status of LEDs used to report the central application
 *          activity.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_central_evt(ble_evt_t const * p_ble_evt)
{
	ret_code_t            err_code;
	ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id)
	{
		// Upon connection, check which peripheral is connected (HR or RSC), initiate DB
		// discovery, update LEDs status, and resume scanning, if necessary.
	case BLE_GAP_EVT_CONNECTED:
	{
		NRF_LOG_INFO("Central connected");
		// If no Heart Rate sensor or RSC sensor is currently connected, try to find them on this peripheral.
		if ((m_conn_handle_hrs_c == BLE_CONN_HANDLE_INVALID)
			|| (m_conn_handle_rscs_c == BLE_CONN_HANDLE_INVALID))
		{
			NRF_LOG_INFO("Attempt to find HRS or RSC on conn_handle 0x%x", p_gap_evt->conn_handle);

			err_code = ble_db_discovery_start(&m_db_discovery[0], p_gap_evt->conn_handle);
			if (err_code == NRF_ERROR_BUSY)
			{
				err_code = ble_db_discovery_start(&m_db_discovery[1], p_gap_evt->conn_handle);
				APP_ERROR_CHECK(err_code);
			}
			else
			{
				APP_ERROR_CHECK(err_code);
			}
		}

		// Assign connection handle to the QWR module.
		multi_qwr_conn_handle_assign(p_gap_evt->conn_handle);

		// Update LEDs status, and check whether to look for more peripherals to connect to.
		bsp_board_led_on(CENTRAL_CONNECTED_LED);
		if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
		{
			bsp_board_led_off(CENTRAL_SCANNING_LED);
		}
		else
		{
			// Resume scanning.
			bsp_board_led_on(CENTRAL_SCANNING_LED);
			scan_start();
		}
	} break; // BLE_GAP_EVT_CONNECTED

	// Upon disconnection, reset the connection handle of the peer that disconnected,
	// update the LEDs status and start scanning again.
	case BLE_GAP_EVT_DISCONNECTED:
	{
		if (p_gap_evt->conn_handle == m_conn_handle_hrs_c)
		{
			NRF_LOG_INFO("HRS central disconnected (reason: %d)",
				p_gap_evt->params.disconnected.reason);

			m_conn_handle_hrs_c = BLE_CONN_HANDLE_INVALID;

			err_code = nrf_ble_scan_filter_set(&m_scan,
				SCAN_UUID_FILTER,
				&m_adv_uuids[HART_RATE_SERVICE_UUID_IDX]);
			APP_ERROR_CHECK(err_code);
		}
		if (p_gap_evt->conn_handle == m_conn_handle_rscs_c)
		{
			NRF_LOG_INFO("RSC central disconnected (reason: %d)",
				p_gap_evt->params.disconnected.reason);

			m_conn_handle_rscs_c = BLE_CONN_HANDLE_INVALID;

			err_code = nrf_ble_scan_filter_set(&m_scan,
				SCAN_UUID_FILTER,
				&m_adv_uuids[RSCS_SERVICE_UUID_IDX]);
			APP_ERROR_CHECK(err_code);
		}

		if ((m_conn_handle_rscs_c == BLE_CONN_HANDLE_INVALID)
			|| (m_conn_handle_hrs_c == BLE_CONN_HANDLE_INVALID))
		{
			// Start scanning.
			scan_start();

			// Update LEDs status.
			bsp_board_led_on(CENTRAL_SCANNING_LED);
		}

		if (ble_conn_state_central_conn_count() == 0)
		{
			bsp_board_led_off(CENTRAL_CONNECTED_LED);
		}
	} break; // BLE_GAP_EVT_DISCONNECTED

	case BLE_GAP_EVT_TIMEOUT:
	{
		// No timeout for scanning is specified, so only connection attemps can timeout.
		if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
		{
			NRF_LOG_INFO("Connection Request timed out.");
		}
	} break;

	case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
	{
		// Accept parameters requested by peer.
		err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
			&p_gap_evt->params.conn_param_update_request.conn_params);
		APP_ERROR_CHECK(err_code);
	} break;

	case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
	{
		NRF_LOG_DEBUG("PHY update request.");
		ble_gap_phys_t const phys =
		{
			.rx_phys = BLE_GAP_PHY_AUTO,
			.tx_phys = BLE_GAP_PHY_AUTO,
		};
		err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
		APP_ERROR_CHECK(err_code);
	} break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		NRF_LOG_DEBUG("GATT Client Timeout.");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		NRF_LOG_DEBUG("GATT Server Timeout.");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	default:
		// No implementation needed.
		break;
	}
}


/**@brief   Function for handling BLE events from peripheral applications.
 * @details Updates the status LEDs used to report the activity of the peripheral applications.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_peripheral_evt(ble_evt_t const * p_ble_evt)
{
	ret_code_t            err_code;
	ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id)
	{
	case BLE_GAP_EVT_CONNECTED:
		NRF_LOG_INFO("Peripheral connected");
		bsp_board_led_off(PERIPHERAL_ADVERTISING_LED);
		bsp_board_led_on(PERIPHERAL_CONNECTED_LED);

		// Assign connection handle to the QWR module.
		multi_qwr_conn_handle_assign(p_ble_evt->evt.gap_evt.conn_handle);
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		NRF_LOG_INFO("Peripheral disconnected. conn_handle: 0x%x, reason: 0x%x",
			p_gap_evt->conn_handle,
			p_gap_evt->params.disconnected.reason);

