eesimonsu/nRF5_SDK_15.3.0/examples/ble_central_and_peripheral/experimental/ble_app_scan_adv_test/main.c
		bsp_board_led_off(PERIPHERAL_CONNECTED_LED);
		break;

	case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
	{
		NRF_LOG_DEBUG("PHY update request.");
		ble_gap_phys_t const phys =
		{
			.rx_phys = BLE_GAP_PHY_AUTO,
			.tx_phys = BLE_GAP_PHY_AUTO,
		};
		err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
		APP_ERROR_CHECK(err_code);
	} break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		NRF_LOG_DEBUG("GATT Client Timeout.");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		NRF_LOG_DEBUG("GATT Server Timeout.");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	default:
		// No implementation needed.
		break;
	}
}


/**@brief Function for handling advertising events.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
	switch (ble_adv_evt)
	{
	case BLE_ADV_EVT_FAST:
	{
		NRF_LOG_INFO("Fast advertising.");
		bsp_board_led_on(PERIPHERAL_ADVERTISING_LED);
	} break;

	case BLE_ADV_EVT_IDLE:
	{
		ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
		APP_ERROR_CHECK(err_code);
	} break;

	default:
		// No implementation needed.
		break;
	}
}


/**@brief Function for checking whether a bluetooth stack event is an advertising timeout.
 *
 * @param[in] p_ble_evt Bluetooth stack event.
 */
static bool ble_evt_is_advertising_timeout(ble_evt_t const * p_ble_evt)
{
	return (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_SET_TERMINATED);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
	uint16_t conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
	uint16_t role = ble_conn_state_role(conn_handle);

	// Based on the role this device plays in the connection, dispatch to the right handler.
	if (role == BLE_GAP_ROLE_PERIPH || ble_evt_is_advertising_timeout(p_ble_evt))
	{
		ble_hrs_on_ble_evt(p_ble_evt, &m_hrs);
		ble_rscs_on_ble_evt(p_ble_evt, &m_rscs);
		on_ble_peripheral_evt(p_ble_evt);
	}
	else if ((role == BLE_GAP_ROLE_CENTRAL) || (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_REPORT))
	{
		const ble_gap_evt_adv_report_t *p_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
		const ble_data_t *data = &p_adv_report->data;

		int8_t *rssi_data = p_ble_evt->evt.gap_evt.params.adv_report.rssi;//get rssi value

		uint16_t parsed_name_len;
		uint16_t offset = 0;
		uint8_t *name_data;
		uint8_t *p_manufacture_data;
		BLE_Rx_Tx_Buffer_t tempbuffer;
		BLE_Rx_Tx_Buffer_t *p_tmp_Rxbuf = &tempbuffer;
		//uint8_t pre_seq_num[4]={'\0'};
		//uint8_t recent_dst = 0x02;//recent destination
		uint8_t assign_seq = 0;//decide which source

//        NRF_LOG_DEBUG("AD->");
//        NRF_LOG_HEXDUMP_DEBUG(data->p_data, data->len);
//        NRF_LOG_DEBUG("<-AD");

		// *mfd_data is a pointer to BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA data

		name_data = ble_advdata_parse(data->p_data, data->len, BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);
		parsed_name_len = ble_advdata_search(data->p_data,
			data->len,
			&offset,
			BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);


		if (name_data != NULL)
		{

			//NRF_LOG_DEBUG("BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME");
			//NRF_LOG_HEXDUMP_DEBUG(name_data, parsed_name_len);



			data = &p_adv_report->data;
			offset = 0;
			p_manufacture_data = ble_advdata_parse(data->p_data, data->len, BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA);//receive manufacture data

			p_tmp_Rxbuf = (BLE_Rx_Tx_Buffer_t *)p_manufacture_data;

			/*
			NRF_LOG_DEBUG("BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA");
			   NRF_LOG_HEXDUMP_DEBUG(p_manufacture_data, parsed_name_len);//print specific data value
			   offset = 0;

			  // p_tmp_Rxbuf -> preamble = 0x56;
			uint8_t *p_tmp_preamble = &p_tmp_Rxbuf->preamble;
			NRF_LOG_DEBUG("BLE_GAP_AD_TYP");
			   NRF_LOG_HEXDUMP_DEBUG(&p_tmp_Rxbuf->preamble,1);//print specific data value
			   offset = 0;*/

			if (p_tmp_Rxbuf->preamble == 0x56)//if not 0x56,turn back
			{

                          if (p_tmp_Rxbuf->hopcount == 1)//if hopcount=1,turn back
					return;

				else if (p_tmp_Rxbuf->dst_addr != recent_dst)//if destination different from recent_dst,turn back
					return;




				parsed_name_len = ble_advdata_search(data->p_data,
					data->len,
					&offset,
					BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA);

				if (p_manufacture_data != NULL)
				{

					switch (p_tmp_Rxbuf->source_addr)
					{
					case 0x01:
						assign_seq = 0;
						break;
					case 0x02:
						assign_seq = 1;
						break;
					case 0x03:
						assign_seq = 2;
						break;
					case 0x04:
						assign_seq = 3;
						break;

					default:
						break;
					}


					if (p_tmp_Rxbuf->seq_num > pre_seq_num[assign_seq] || p_tmp_Rxbuf->seq_num == 0x00)//seq_num 0~255 in function
					{

						NRF_LOG_DEBUG("BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA");
						NRF_LOG_HEXDUMP_DEBUG(p_manufacture_data, parsed_name_len);//print specific data value
						offset = 0;

						pre_seq_num[assign_seq] = p_tmp_Rxbuf->seq_num;//update new seq_num
						NRF_LOG_DEBUG("SEQ");
						NRF_LOG_HEXDUMP_DEBUG(&pre_seq_num[assign_seq], 1);//print specific data value

						p_tmp_Rxbuf->hopcount--; //hopcount -1

					}

					else
						return;
				}
			}
			else if (p_tmp_Rxbuf-> preamble == 0x66)
			{
                             if(recent_dst == p_tmp_Rxbuf -> source_addr)
                              {
                                  recent_rssi = rssi_data;
                                  NRF_LOG_DEBUG("RSSI VALUE");
                                  NRF_LOG_INFO("rssi =%d dBm", rssi_data);//print RSSI value
                                  NRF_LOG_DEBUG("ADDRESS");
                                  NRF_LOG_INFO("addr =%x ",recent_dst );//print RSSI value 
                              }
                             else
                             {  
                                  if(rssi_data > recent_rssi)
                                       recent_dst = p_tmp_Rxbuf -> source_addr;
                                       NRF_LOG_DEBUG("ADDRESS");
                                       NRF_LOG_INFO("addr =%x ",recent_dst );//print RSSI value 
                                 
