eesimonsu/nRF5_SDK_15.3.0/examples/ble_central_and_peripheral/experimental/ble_app_scan_adv_test/main.c
	// Initialize the Running Speed and Cadence Service.
	memset(&rscs_init, 0, sizeof(rscs_init));

	rscs_init.evt_handler = NULL;
	rscs_init.feature = BLE_RSCS_FEATURE_INSTANT_STRIDE_LEN_BIT |
		BLE_RSCS_FEATURE_WALKING_OR_RUNNING_STATUS_BIT;

	// Here the sec level for the Running Speed and Cadence Service can be changed or increased.
	rscs_init.rsc_feature_rd_sec = SEC_OPEN;
	rscs_init.rsc_meas_cccd_wr_sec = SEC_OPEN;

	err_code = ble_rscs_init(&m_rscs, &rscs_init);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the advertising functionality.
 */
static void advertising_init(void)
{
	ret_code_t             err_code;
	ble_advertising_init_t init;
	ble_advdata_manuf_data_t                  adv_manuf_data;
	uint8_t                                   adv_manuf_data_data[] = { 0x56,0x01,0x78,0x44,0x03 };

	memset(&init, 0, sizeof(init));

	init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = true;
	init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	//init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	//init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

	init.config.ble_adv_fast_enabled = true;
	init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
	init.config.ble_adv_fast_timeout = APP_ADV_DURATION;

	init.evt_handler = on_adv_evt;

	adv_manuf_data.data.p_data = adv_manuf_data_data;
	adv_manuf_data.data.size = strlen(adv_manuf_data_data);
	adv_manuf_data.company_identifier = 0x0059; //Nordic's company ID
	init.advdata.p_manuf_specific_data = &adv_manuf_data;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing logging.
 */
static void log_init(void)
{
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop). If there is no pending log operation,
		  then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{
	if (NRF_LOG_PROCESS() == false)
	{
		nrf_pwr_mgmt_run();
	}
}


/**@brief Function for initializing the timer.
 */
static void timer_init(void)
{
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the application main entry.
 */
int main(void)
{
	bool erase_bonds;

	// Initialize.
	log_init();
	timer_init();
	buttons_leds_init(&erase_bonds);
	power_management_init();
	ble_stack_init();
	scan_init();
	gap_params_init();
	gatt_init();
	conn_params_init();
	db_discovery_init();
	peer_manager_init();
	hrs_c_init();
	rscs_c_init();
	services_init();
	advertising_init();

	/* BLE_Rx_Tx_Buffer_t test1;


	 memset(&test1,0,sizeof(test1));

	 test1.preamble=0x00;
	 test1.dst_addr=0x68;
	 test1.source_addr=0x45;
	 test1.seq_num=0x04;
	 test1.hopcount=0x02; */


	 // Start execution.
	NRF_LOG_INFO("Relay example started.");

	if (erase_bonds == true)
	{
		// Scanning and advertising is done upon PM_EVT_PEERS_DELETE_SUCCEEDED event.
		delete_bonds();
	}
	else
	{
		adv_scan_start();
	}

	// Enter main loop.
	for (;;)
	{
		idle_state_handle();
	}
}
